Revit 2027 API
BuiltInFailures.ComponentRepeaterFailures.ComponentRepeater_ThereIsOnlyOneInstanceInThisRepeater Property
 There is only one component in this repeater.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId ComponentRepeater_ThereIsOnlyOneInstanceInThisRepeater { get; }
Public Shared ReadOnly Property ComponentRepeater_ThereIsOnlyOneInstanceInThisRepeater As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ ComponentRepeater_ThereIsOnlyOneInstanceInThisRepeater {
	FailureDefinitionId^ get ();
}
static member ComponentRepeater_ThereIsOnlyOneInstanceInThisRepeater : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.ComponentRepeaterFailures Class
Autodesk.Revit.DB Namespace